# Ultralytics YOLO , GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.00  # scales module repeats
width_multiple: 1.25  # scales convolution channels

backbone:
  # [from, repeats, module, args]            路 640  640  3
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2     路 320  320  64
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4     路 160  160  128
  - [-1, 3, C2f, [128, True]]   # 2          路 160  160  128
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8     路  80  80  256
  - [-1, 6, C2f, [256, True]]   # 4          路  80  80  256
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16    路  40  40  512
  - [-1, 6, C2f, [512, True]]   # 6          路  40  40  512
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32    路  20  20  1024
  - [-1, 3, C2f, [1024, True]]  # 8          路  20  20  1024
  - [-1, 1, SPPF, [1024, 5]]    # 9          路  20  20  1024

# YOLOv8.0-P2 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    路  40  40  1024
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4     路  40  40  1536
  - [-1, 3, C2f, [512]] # 12                        路  40  40  512

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    路  80  80  512
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3     路  80  80  768
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)           路  80  80  256

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #    路 160  160  256
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2     路 160  160  384
  - [-1, 3, C2f, [128]] # 18 (P2/4-tiny)            路 160  160  128

  - [-1, 1, Conv, [128, 3, 2]] #                    路  80  80  128
  - [[-1, 15], 1, Concat, [1]] # cat head P3        路  80  80  384
  - [-1, 3, C2f, [256]] # 21 (P3/8-small)           路  80  80  256

  - [-1, 1, Conv, [256, 3, 2]] #                    路  40  40  256
  - [[-1, 12], 1, Concat, [1]] # cat head P4        路  40  40  768
  - [-1, 3, C2f, [512]] # 24 (P4/16-medium)         路  40  40  512

#  - [-1, 1, Conv, [512, 3, 2]] #                    路  20  20  512
#  - [[-1, 9], 1, Concat, [1]] # cat head P5         路  20  20  1536
#  - [-1, 3, C2f, [1024]] # 27 (P5/32-large)         路  20  20  1024

  - [[18, 21, 24], 1, Segment, [nc, 32, 256]] # Detect(P2, P3, P4, P5)
